In [1]:
import pandas as pd
import numpy as np
import random

In [3]:
df_muestra_netflix = pd.read_csv('dat_muestra_nflix.csv') #modificar ruta

In [4]:
df_muestra_netflix.head(10) #para ver cómo se encuentran los datos

   peli_id  usuario_id_orig  calif       fecha  usuario_id
0        1             2442      3  2004-04-14           1
1        1          1086807      3  2004-12-28           2
2        1          2165002      4  2004-04-06           3
3        1          1133214      4  2004-03-07           4
4        1          1537427      4  2004-03-29           5
5        1           525356      2  2004-07-11           6
6        1          1910569      4  2004-04-12           7
7        1          2421815      2  2004-02-26           8
8        1          2508819      3  2004-05-18           9
9        1          1342007      3  2004-07-16          10

In [5]:
df_muestra_netflix.shape #para saber el número de filas y columnas

(20968941, 5)

In [7]:
df_muestra_netflix_libmf=df_muestra_netflix[['usuario_id', 'peli_id', 'calif']] #seleccionamos únicamente las columnas que necesitamos para la librería y en el mismo orden

In [8]:
df_muestra_netflix_libmf.head(10)

   usuario_id  peli_id  calif
0           1        1      3
1           2        1      3
2           3        1      4
3           4        1      4
4           5        1      4
5           6        1      2
6           7        1      4
7           8        1      2
8           9        1      3
9          10        1      3

In [9]:
random.seed(28882)
df_muestra_netflix_libmf_mini=df_muestra_netflix_libmf.sample(frac=0.01) #para entender mejor la librería se harán ejercicios con muestras pequeñas
df_muestra_netflix_libmf_mini.head()

          usuario_id  peli_id  calif
1227905         4536     1148      4
16589940       33379    14367      3
12820412       14173    11186      3
9868426        25154     8524      4
12371734       10125    10906      3

In [22]:
df_muestra_netflix_libmf_mini.shape

(209689, 3)

In [10]:
#empezando a armar la muestra de entrenamiento y validacion
random.seed(28882)
usuarios=pd.DataFrame(df_muestra_netflix_libmf_mini['usuario_id'].unique(), columns=['usuario_id'])
valida_usuarios= usuarios.sample(frac=0.2)  
peliculas=pd.DataFrame(df_muestra_netflix_libmf_mini['peli_id'].unique(), columns=['peli_id'])
valida_pelis=peliculas.sample(frac=0.2)

In [11]:
#print(df_muestra_netflix_libmf_mini[df_muestra_netflix_libmf_mini['usuario_id'] == 29363])

In [12]:
df_valida= pd.merge(df_muestra_netflix_libmf_mini,valida_usuarios, on ='usuario_id', how='inner') #intersección entre df_muestra_netflix_libmf_mini y valida_usuarios

In [13]:
#print(df_valida[df_valida['peli_id'] == 5582])

In [14]:
#muestra de validación
data_valida= pd.merge(df_valida,valida_pelis, on ='peli_id', how='inner') #intersección entre df_valida y valida_pelis

In [15]:
data_valida.shape #dimension de la muestra de validación

(7999, 3)

In [35]:
data_valida.head(10)

   usuario_id  peli_id  calif
0        4536     9234      2
1       22339     9234      5
2        4103     9234      1
3        9316     9234      3
4       24432     9234      2
5       11220     9234      2
6       13108     9234      3
7       83929     9234      4
8        4494     9234      2
9       10458    16384      4

In [20]:
#para obtener la muestra de entrenamiento, sacaremos los registros de df_muestra_netflix_libmf_mini que no estén en data_valida
#union=pd.merge(df_muestra_netflix_libmf_mini, data_valida, how='outer',on=['usuario_id', 'peli_id']) 
left= pd.merge(df_muestra_netflix_libmf_mini, data_valida, how='left',on=['usuario_id', 'peli_id'])

In [43]:
data_entrena=left[left.isnull().any(axis=1)][['usuario_id', 'peli_id','calif_x']]

In [45]:
data_entrena.head(10)

   usuario_id  peli_id  calif_x
0        4536     1148        4
1       33379    14367        3
2       14173    11186        3
3       25154     8524        4
4       10125    10906        3
5       27070    11937        3
6       54043      494        5
7        7230     8643        4
8       36731     4141        4
9       10458     9616        4

In [46]:
data_entrena.shape

(201690, 3)